twitter_app/app/controllers/posts_controller.rb

SELECT * FROM `posts` ORDER BY created_at DESC
---
	def index
		@posts = Post.all(:order=>"created_at DESC")

INSERT INTO `posts` (`message`, `created_at`, `updated_at`) VALUES('hello everyone!!!', '2016-05-25 06:38:13', '2016-05-25 06:38:13')
---
	def create
		@post = Post.create(:message => params[:message])